app/controllers/portfolios_controller.rb

SELECT "portfolios".* FROM "portfolios" LIMIT 1
---
  def index
    @portfolio_active = "active"
    @portfolios = Portfolio.all

SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT 1  [["id", "favicon"]]
---
  def show
    @portfolio = Portfolio.find(params[:id])

INSERT INTO "portfolios" ("created_at", "image", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "name", "rank", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @portfolio = Portfolio.new(params[:portfolio])

    respond_to do |format|
      if @portfolio.save

SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "portfolios" WHERE "portfolios"."id" = ?  [["id", 1]]
---
  def destroy
    @portfolio = Portfolio.find(params[:id])
    @portfolio.destroy